Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32429I-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                   |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |WAKEUP [B2 Button]            |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |+TIM2_CH1 *TIM5_CH1                       |          |    |          |           
PA1 , // |MII_RX_CLK                    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |+TIM2_CH2 *TIM5_CH2                       |          |    |          |           
PA2 , // |MII_MDIO                      |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 +TIM5_CH3             |          |    |          |           
PA3 , // |ULPI_D0 [USB3300_D0]          |    |    |    |     |     |     |     |     |     |      |+RX   |      |      |*IN3 |*TIM2_CH4 +TIM5_CH4 +TIM9_CH2             |          |    |          |           
PA4 , // |PAR_HSYNC                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |ULPI_CK [USB3300_CLKOUT]      |    |    |    |+SCK |     |     |     |     |     |      |      |      |      |*IN5 |+TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |PAR_PCLK                      |    |    |    |+MISO|     |     |     |     |     |      |      |      |      |*IN6 |+TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |MII_RX_DV                     |    |    |    |+MOSI|     |     |     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 +TIM3_CH2 +TIM1_CH1N|          |    |          |           
PA8 , // |MII_MCO                       |    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PA9 , // |RS232/IrDA_TX [ST3241_TX]     |    |    |    |     |     |     |     |     |     |+TX   |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PA10, // |RS232/IrDA_RX [ST3241_RX]     |    |    |    |     |     |     |     |     |     |+RX   |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PA11, // |USB_FS1_DM                    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_FS1_DP                    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |TMS/SWDIO                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |TCK/SWCLK                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |TDI                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |ULPI_D1 [USB3300_D1]          |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |+TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |ULPI_D2 [USB3300_D2]          |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |+TIM3_CH4 *TIM1_CH3N +TIM8_CH3N           |          |    |          |           
PB2 , // |BOOT1 [SW2]                   |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |TDO/SWO                       |    |    |    |*SCK |     |*SCK |     |     |     |      |      |      |      |     |*TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |TRST                          |    |    |    |*MISO|     |*MISO|     |     |     |      |      |      |      |     |*TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |ULPI_D7 [USB3300_D7]          |    |    |    |*MOSI|     |*MOSI|     |     |     |      |      |      |      |     |*TIM3_CH2                                 |          |    |          |           
PB6 , // |I2C1_SCL [WM8994_SCLK]        |+SCL|    |    |     |     |     |     |     |     |*TX   |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PB7 , // |                              |+SDA|    |    |     |     |     |     |     |     |*RX   |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PB8 , // |MII_TXD3                      |*SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1 *TIM4_CH3                      |          |*D4 |          |           
PB9 , // |I2C1_SDA [WM8994_SDA]         |*SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM11_CH1 *TIM4_CH4                      |          |*D5 |          |           
PB10, // |ULPI_D3 [USB3300_D3]          |    |+SCL|    |     |+SCK |     |     |     |     |      |      |+TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |ULPI_D4 [USB3300_D4]          |    |+SDA|    |     |     |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |ULPI_D5 [USB3300_D5]          |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |ULPI_D6 [USB3300_D6]          |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |*TIM1_CH1N                                |          |    |          |           
PB14, // |                              |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |     |+TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|    |          |           
PB15, // |                              |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |     |+TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|    |          |           
PC0 , // |ULPI_STP [USB3300_STP]        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |MII_MDC                       |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |MII_TXD2                      |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |MII_TX_CLK                    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |MII_RXD0                      |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |MII_RXD1                      |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |                              |    |    |    |     |     |     |     |     |     |      |      |      |+TX   |     |+TIM8_CH1 +TIM3_CH1                       |          |*D6 |          |           
PC7 , // |                              |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |+TIM8_CH2 +TIM3_CH2                       |          |*D7 |          |           
PC8 , // |uSD_D0                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH3 *TIM3_CH3                       |          |*D0 |          |           
PC9 , // |uSD_D1                        |    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH4 *TIM3_CH4                       |          |*D1 |          |           
PC10, // |uSD_D2                        |    |    |    |     |     |+SCK |     |     |     |      |      |*TX   |      |     |                                          |          |*D2 |          |           
PC11, // |uSD_D3                        |    |    |    |     |     |+MISO|     |     |     |      |      |*RX   |      |     |                                          |          |*D3 |          |           
PC12, // |uSD_CLK                       |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |*CK |          |           
PC13, // |TAMPER_KEY [B3 Blue Button]   |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |OSC32_IN                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |OSC32_OUT                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |D2                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |D3                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |uSD_CMD                       |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |PAR_D5                        |    |    |    |     |*SCK |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |FMC_NOE [NorFlash_G]          |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |FMC_NWE [NorFlash_W]          |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |     |                                          |          |    |          |           
PD6 , // |FMC_NWAIT [NorFlash_R/B]      |    |    |    |     |     |+MOSI|     |     |     |      |*RX   |      |      |     |                                          |          |    |          |           
PD7 , // |FMC_NE1 [NorFlash_E]          |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |D13                           |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |D14                           |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |D15                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |A16                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |A17                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PD13, // |A18                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PD14, // |D0                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH3                                 |          |    |          |           
PD15, // |D1                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH4                                 |          |    |          |           
PE0 , // |FMC_NBL0 [SRAM_BLE/SDRAM_DQM0]|    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |FMC_NBL1 [SRAM_BHE/SDRAM_DQM1]|    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |                              |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |                              |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |SAI1_SDA [WM8994_ADCDAT1]     |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |D4                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |D5                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |D6                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PE10, // |D7                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |D8                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PE12, // |D9                            |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |D10                           |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PE14, // |D11                           |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |+TIM1_CH4                                 |          |    |          |           
PE15, // |D12                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |A0                            |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |A1                            |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |A2                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |A3                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |A4                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |A4                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |SAI1_SDB [WM8994_DACDAT1]     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1                                |          |    |          |           
PF7 , // |SAI1_MCLKB [WM8994_MCLK1]     |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |+TIM11_CH1                                |          |    |          |           
PF8 , // |SAI1_SCKB [WM8994_BCLK1]      |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |SAI1_FSB [WM8994_LRCLK1]      |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |Potentiometer [RV1]           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |SDNRAS [SDRAM_RAS]            |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |A6                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |A7                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |A8                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |A9                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |A10                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |A11                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |A12                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |A13                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |A14 [A14/SDRAM_BA0]           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |A15 [A15/SDRAM_BA1]           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |LED1 [Green Led]              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |LED2 [Orange Led]             |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |SDCLK [SDRAM_CLK]             |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |FMC_NE2 [SRAM_CE]             |    |    |    |     |     |     |     |     |     |      |      |      |*RX   |     |                                          |          |    |          |           
PG10, // |LED3 [Red Led]                |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |MII_TX_EN                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG12, // |LED4 [Bleu Led]               |    |    |    |     |     |     |     |     |*MISO|      |      |      |      |     |                                          |          |    |          |           
PG13, // |MII_TXD0                      |    |    |    |     |     |     |     |     |*SCK |      |      |      |      |     |                                          |          |    |          |           
PG14, // |MII_TXD1                      |    |    |    |     |     |     |     |     |*MOSI|      |      |      |*TX   |     |                                          |          |    |          |           
PG15, // |SDNCAS [SDRAM_CAS]            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH0 , // |OSC_IN                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_IN   |           
PH1 , // |OSC_OUT                       |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_OUT  |           
